<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"00b31a15e61f936858a2509969ee7ec72b459f4404bba5256add73f62d97f09c","plan_job_ref":"Job Plan Airflow DAGs #388 at https://github.com/cal-itp/data-infra/actions/runs/16507416144","plan_out_hash":"16d5a83bb2cf7c6ec5c350aa7653f85101dee939726cc0cf48405a5f747d8346","plan_hash":"d0e695938b1d98733ea62757da7800fbb3113db86ee041b70f39e82851b37222","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 2 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "6sAQZg==" -> (known after apply)
!~      detect_md5hash      = "XpJ8tKiLNLQeAM1YMW8LXQ==" -> "different hash"
!~      generation          = 1753205763664721 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "XpJ8tKiLNLQeAM1YMW8LXQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/gtfs/_int_gtfs.yaml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "rwMIMA==" -> (known after apply)
!~      detect_md5hash      = "T07Rr8u8NH1CM9p/qlrCBA==" -> "different hash"
!~      generation          = 1751416668478590 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/gtfs/_int_gtfs.yaml"
!~      md5hash             = "T07Rr8u8NH1CM9p/qlrCBA==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs/_int_gtfs.yaml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/gtfs/int_gtfs_rt_vs_sched__stops_served_vehicle_positions.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/intermediate/gtfs/int_gtfs_rt_vs_sched__stops_served_vehicle_positions.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/intermediate/gtfs/int_gtfs_rt_vs_sched__stops_served_vehicle_positions.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/gtfs/int_gtfs_schedule__stop_times_grouped.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "gElm9g==" -> (known after apply)
!~      detect_md5hash      = "yDLEGvytnnWa5vUOCwQvEw==" -> "different hash"
!~      generation          = 1751416661143892 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/gtfs/int_gtfs_schedule__stop_times_grouped.sql"
!~      md5hash             = "yDLEGvytnnWa5vUOCwQvEw==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs/int_gtfs_schedule__stop_times_grouped.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_vehicle_locations_path.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "d+JBfA==" -> (known after apply)
!~      detect_md5hash      = "dvuSMtXVHhvZNA9RlS/FIw==" -> "different hash"
!~      generation          = 1752161967800132 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_vehicle_locations_path.sql"
!~      md5hash             = "dvuSMtXVHhvZNA9RlS/FIw==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_vehicle_locations_path.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_vehicle_positions_stop_metrics.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs/fct_vehicle_positions_stop_metrics.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs/fct_vehicle_positions_stop_metrics.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "dgq91A==" -> (known after apply)
!~      detect_md5hash      = "wv+KQdvgaOkZVtoXucgzlw==" -> "different hash"
!~      generation          = 1753205765234099 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "wv+KQdvgaOkZVtoXucgzlw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #388](https://github.com/cal-itp/data-infra/actions/runs/16507416144)